# Taps (Sources for apps)
tap "homebrew/cask"
tap "homebrew/cask-fonts"
# Fonts (Crucial for Starship icons)
cask "font-fira-code"
cask "font-fira-code-nerd-font"
# Core Command Line Tools
brew "git"
brew "fnm"          # Fast Node Manager
brew "starship"     # The prompt theme
brew "zoxide"       # The 'z' command (better cd)
brew "direnv"       # Safe .env loader
brew "gh"           # GitHub CLI
brew "fzf"          # Fuzzy finder (optional but highly recommended)
brew "bat"
brew "graphviz"
brew "pnpm"
cask "fork"
cask "raycast"
# Applications
cask "brave-browser"          # Replaces Chrome
cask "cursor"                 # Your editor (Code - Insiders)
cask "visual-studio-code"     # Useful to have as backup
cask "ghostty"                # Better terminal (optional)
cask "docker"                 # Docker Desktop
cask "slack"
cask "1password"
cask "spotify"
cask "rectangle"
cask "imageoptim"
cask "cleanshot"
vscode "anthropic.claude-code"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "ionutvmi.path-autocomplete"
vscode "k--kato.intellij-idea-keybindings"
vscode "kamikillerto.vscode-colorize"
vscode "leizongmin.node-module-intellisense"
vscode "mikestead.dotenv"
vscode "raillyhugo.one-hunter"
vscode "redhat.vscode-yaml"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "smulyono.reveal"
vscode "streetsidesoftware.code-spell-checker"
vscode "stylelint.vscode-stylelint"
vscode "unifiedjs.vscode-mdx"
vscode "vscode-icons-team.vscode-icons"
vscode "wayou.vscode-todo-highlight"
vscode "whtouche.vscode-js-console-utils"
vscode "yoavbls.pretty-ts-errors"
vscode "yzhang.markdown-all-in-one"
