brew "git"
brew "graphviz"
brew "mcpm"
brew "node"
brew "nvm"
brew "pipx"
brew "pnpm"
brew "yarn"
cask "fork"
cask "raycast"
vscode "anthropic.claude-code"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "ionutvmi.path-autocomplete"
vscode "k--kato.intellij-idea-keybindings"
vscode "kamikillerto.vscode-colorize"
vscode "leizongmin.node-module-intellisense"
vscode "mikestead.dotenv"
vscode "raillyhugo.one-hunter"
vscode "redhat.vscode-yaml"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "smulyono.reveal"
vscode "streetsidesoftware.code-spell-checker"
vscode "stylelint.vscode-stylelint"
vscode "unifiedjs.vscode-mdx"
vscode "vscode-icons-team.vscode-icons"
vscode "wayou.vscode-todo-highlight"
vscode "whtouche.vscode-js-console-utils"
vscode "yoavbls.pretty-ts-errors"
vscode "yzhang.markdown-all-in-one"
